Repository: GuGarcia/ptut-eklerni
Catalog: src/Eklerni/BackBundle/Resources/translations/messages.*.xlf
Languages: fr

# Ajout d'un Eleve à la Classe : %name%
source: Add a pupil to the classroom : %name%
fr: Ajout d'un élève à la classe : %name%

# Classe %name%
source: Classroom %name%
fr: Classe %name%

# activite.delete.fail
source: An error occurred when removing the activity.
fr: Une erreur est survenue lors de la suppression de l'activité.

# activite.delete.success
source: Activity successfully removed.
fr: L'activité a été supprimée avec succès.

# activite.name
source: Name
fr: Nom de l'activité

# activite.notfound
source: Activity not found.
fr: Activité introuvable.

source: activite.text
fr: Activité

# btn.eleve.add
source: Add a pupil
fr: Ajouter un élève

# btn.logout
source: Logout
fr: Déconnexion

# btn.navigation.toogle
source: Show/hide the navbar
fr: Afficher/masquer la navigation

source: btn.profile
fr: Profil

# button.validation
source: Submit
fr: Valider

# classe.add.enseignant.fail
source: An error occurred when binding the teacher to the classroom.
fr: Une erreur est survenue lors de la liaison de l'enseignant à la classe.

# classe.add.enseignant.success
source: Teacher successfully bound to the classroom.
fr: L'enseignant a été lié à la classe avec succès.

# classe.delete.enseignant.fail
source: An error occurred when removing the classroom's teacher.
fr: Une erreur est survenue lors de l'ajout des permissions à l'enseignant.

# classe.delete.enseignant.success
source: Teacher successfully unsubscribed from the classroom.
fr: Les permissions de l'enseignant ont bien été retirées.

# classe.delete.fail
source: An error occurred when removing the classroom.
fr: Une erreur est survenue lors de la suppression de la classe.

# classe.delete.success
source: Classroom successfully removed.
fr: La classe a été supprimée avec succès.

# classe.eleve.count
source: Number of pupils
fr: Nombre d'élèves

# classe.level
source: Grade
fr: Niveau

# classe.list
source: Classrooms' list
fr: Liste des classes

# classe.name
source: Name
fr: Nom

# classe.name.colon
source: Classroom :
fr: Classe :

# classe.no.eleve
source: This class has no pupils.
fr: Cette classe ne contient pas d'élèves.

# classe.save.matiere.fail
source: An error occurred when saving the subject.
fr: Une erreur est survenue lors de l'ajout de la matière à la classe.

# classe.save.matiere.success
source: Subject successfully added to the classroom.
fr: La matière a été ajoutée à la classe avec succès.

# classe.text
source: Classroom
fr: Classe

# classe.view
source: Classroom profil
fr: Voir la classe

# classe.year
source: Year
fr: Année

source: datedebut.text
fr: Date de début

# difficulte.niveau1
source: Easy
fr: Facile

# difficulte.niveau2
source: Medium
fr: Moyen

# difficulte.niveau3
source: Hard
fr: Difficile

# ecole.city
source: City
fr: Ville

# ecole.classe.count
source: Number of classrooms
fr: Nombre de classes

# ecole.list
source: Schools' list
fr: Liste des écoles

# ecole.name
source: Name
fr: Nom

# ecole.postcode
source: Postal code
fr: Code postal

# ecole.text
source: School
fr: Ecole

# eleve.list
source: Pupils' list
fr: Liste des élèves

source: eleve.no.note
fr: L'élève n'a pas de note.

source: eleve.noteinsuffisante
fr: L'élève n'a pas assez de notes.

source: eleve.text
fr: Élève

# enseignant.add
source: Add a teacher
fr: Ajouter un enseignant

# enseignant.isDirecteur
source: Director
fr: Directeur

# enseignant.list
source: Teachers' list
fr: Liste des enseignants

# enseignant.no.classe
source: You have no classrooms
fr: Vous n'avez pas de classe.

# enseignant.no.eleve
source: You have no pupils.
fr: Vous n'avez aucun élève.

# enseignant.text
source: Teacher
fr: Enseignant

# grade.year1
source: Year 1
fr: CP

# grade.year2
source: Year 2
fr: CE1

# grade.year3
source: Year 3
fr: CE2

# grade.year4
source: Year 4
fr: CM1

# grade.year5
source: Year 5
fr: CM2

source: istest.text
fr: Test ?

# matiere.add_activite
source: Add an activity
fr: Activité

# matiere.delete.fail
source: An error occurred when removing the subject.
fr: Une erreur est survenue lors de la suppression de la matière.

# matiere.delete.success
source: Subject successfully removed.
fr: La matière a été supprimée avec succès.

# matiere.list
source: Subjects' list
fr: Liste des matières

# matiere.name
source: Name
fr: Nom de la matière

# matiere.text
source: School subject
fr: Matière

source: moyenne.text
fr: Moyenne

# no.ecole
source: There is no school.
fr: Il n'y a aucune école à afficher.

# no.enseignant
source: There is no teacher.
fr: Il n'y a aucun enseignant à afficher.

# no.matiere
source: There is no subject.
fr: Il n'y a aucune matière à afficher.

source: note.text
fr: Note

source: password_change.encode_error
fr: Erreur d'encodage lors de la modification du mot de passe.

# personne.birthdate
source: Date of birth
fr: Date de naissance

# personne.birthdate.colon
source: Date of birth :
fr: Date de naissance :

# personne.classe.count
source: Number of classrooms
fr: Nombre de classes

# personne.firstname
source: First name
fr: Prénom

# personne.firstname.colon
source: First name :
fr: Prénom :

# personne.lastname
source: Last name
fr: Nom

# personne.lastname.colon
source: Last name :
fr: Nom :

source: personne.mail
fr: Mail

# personne.name
source: Name
fr: Nom

# personne.password
source: Password
fr: Mot de passe

source: personne.picture
fr: Photo

# personne.username
source: Username
fr: Nom d'utilisateur

# question.label
source: Label
fr: Intitulé

# question.media
source: Media
fr: Média

# question.media.file.audio
source: Audio
fr: Son

# question.media.file.video
source: Video
fr: Vidéo

# question.media.type
source: Type of media
fr: Type de média

# register.encode_error
source: An error occurred when adding a pupil. Please retry.
fr: Une erreur est survenue lors de l'ajout de l'élève. Veuillez réessayer.

# reponse.add
source: Add an answer
fr: Ajouter une réponse

# reponse.label
source: Label
fr: Intitulé

# reponse.media
source: Media
fr: Média

# reponse.media.file.audio
source: Audio
fr: Son

# reponse.media.file.video
source: Video
fr: Vidéo

# reponse.media.type
source: Type of media
fr: Type de média

# reponse.valid
source: Correct answer
fr: Réponse correcte

# reponses.text
source: Answer
fr: Réponse

source: result.list.last
fr: Derniers résultats

source: result.notfound
fr: Aucun résultat

source: resultat.list
fr: Liste des résultats

source: role.directeur
fr: Directeur

source: role.enseignant
fr: Enseignant

# sidebar.classes
source: Classrooms
fr: Classes

# sidebar.exercices
source: Exercises
fr: Exercices

# sidebar.exercices.attribute
source: Exercises attribution
fr: Attribution d'exercices

# sidebar.statistics
source: Statistics
fr: Statistiques

# sidebar.students
source: Pupils
fr: Elèves

# sidebar.tablet
source: Tablet
fr: Vue tablette

source: stats.moyenne.classe
fr: Moyenne de la classe

source: stats.moyenne.eleve
fr: Moyenne de l'élève

source: stats.moyenne.matiere
fr: Moyenne pour la matière

# title.accueil
source: Home
fr: Accueil

# title.classe
source: Classroom
fr: Classes

# title.create_activite
source: New activity
fr: Ajouter une activité

# title.create_classe
source: New classroom
fr: Ajouter une classe

# title.create_ecole
source: New school
fr: Ajouter une école

# title.create_matiere
source: New subject
fr: Ajouter une matière

# title.exercice
source: Exercises
fr: Exercices

# title.modify_activite
source: Edit an activity
fr: Modifier une activité

# title.modify_classe
source: Edit a classroom
fr: Modifier une classe

# title.modify_ecole
source: Add a school
fr: Modifier une école

# title.modify_eleve
source: Edit a pupil
fr: Modifier un élève

# title.modify_matiere
source: Edit a subject
fr: Modifier une matière

# title.statistiques
source: Statistics
fr: Statistiques

# title.tablet
source: Tablet
fr: Tablette

# url.modify.eleve
source: Edit a pupil
fr: Modifier un élève

# utils.delete
source: Remove
fr: Supprimer

source: utils.duplicate
fr: Dupliquer

# utils.modify
source: Edit
fr: Modifier

# utils.save
source: Save
fr: Enregistrer

# utils.tools
source: Tools
fr: Outils
